# ConnectionInputPoint Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConnectionInputPoint Class
Members See Also
---
An object that holds information about a connection input point
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public class ConnectionInputPoint : IDisposable
```

Visual Basic
---
```text
Public Class ConnectionInputPoint _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ConnectionInputPoint : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure..::..ConnectionInputPoint
# See Also
ConnectionInputPoint Members
Autodesk.Revit.DB.Structure Namespace